#include "bh1750fvi.h"
#include <stdio.h>

float result_lx=0;
uint8_t BUF[2]={0};
uint16_t result1750=0;

/**************************************************************
*功  能：端口初始化
*参  数: 无
*返回值: 无 
**************************************************************/
void BH1750_Init(void)
{
	IIC_Init(); 
}

/**************************************************************
*功  能：发送设备地址
*参  数: 无
*返回值: 无 
**************************************************************/
void Cmd_Write_BH1750(uint8_t cmd)
{
    IIC_Start();						//起始信号
    IIC_Send_Byte(BH1750_Addr+0);		//发送设备地址+写信号
	while(IIC_Wait_Ack());
    IIC_Send_Byte(cmd);				//内部寄存器地址
	while(IIC_Wait_Ack());
    IIC_Stop();						//发送停止信号
	Delay_ms(5);
}


/**************************************************************
*功  能：开启一次H分辨率模式
*参  数: 无
*返回值: 无 
**************************************************************/
void Start_BH1750(void)
{
	Cmd_Write_BH1750(BH1750_ON);	 		//power on
	Cmd_Write_BH1750(BH1750_RSET);		//clear
	Cmd_Write_BH1750(BH1750_ONE);  		//一次H分辨率模式，至少120ms，之后自动断电模式  
}

/**************************************************************
*功  能：读光照信号
*参  数: 无
*返回值: 无 
**************************************************************/
void Read_BH1750(void)
{
    IIC_Start();							//起始信号
    IIC_Send_Byte(BH1750_Addr+1);		//发送设备地址+读信号
	while(IIC_Wait_Ack());
	BUF[0]=IIC_Read_Byte(1);				//发送ACK
	BUF[1]=IIC_Read_Byte(0);				//发送NACK
    IIC_Stop();							//停止信号
    Delay_ms(5);
}

/**************************************************************
*功  能：合成光照数据
*参  数: 无
*返回值: 无 
**************************************************************/
void Convert_BH1750(void)
{
	result1750=BUF[0];
	result1750=(result1750<<8)+BUF[1];		//合成数据，即光照数据
	result1750=(double)result1750/1.2;

}

float BH1750_GetLight(void)
{
	Start_BH1750();						//power on
    Delay_ms(120);						//延时120ms

    Read_BH1750();						//连续读取结果 到BUF里面 
    Convert_BH1750();					//转换结果到result_lx

	return result1750;
}
